<!DOCTYPE html>
<html lang="ru">
<head>
		<style>
        	div[style="text-align:center;font-size:11px;font-family:arial;background-color:black;color:white"]{display:none}
			div[style="text-align:center;font-size:11px"]{display:none;}
			div[style="position: fixed; text-align: center; width: auto; height: auto; max-width:100%; z-index: 9999;  top:10px;"]{display:none;}
		</style>
        <meta charset="utf-8">
        <title>ВОВ</title>
        <link rel = "stylesheet" href = "https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
        <link rel="stylesheet" href="style.css">
        <link href="https://fonts.googleapis.com/css?family=Cuprum&display=swap" rel="stylesheet">
		<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
        <script src="https://kit.fontawesome.com/cc6c342b7f.js" crossorigin="anonymous"></script>
		<script src="script.js"></script>
		<script src="jquery-3.4.1.min.js"></script>
	</head>
<body>	
	<div class="header">
		<div class="header-links">
			<a href="index.html" title="Перейти на главную"><i class="fa fa-home"></i>Главная</a>
			<a id="Caesar"  onclick="show('methodCaesar')" title="Перейти в стаистику"><i class="fa fa-file-text-o"></i>Статистика</a>
			<a onclick="sho('esar')" title="Просмотреть операции"><i class="fa fa-globe"></i>Операции</a>
		</div>
		<div class="header-name">
			<h1>Великая Втечественная Война</h1>
			<small>Сайт который расскажет о операциях 1941 - 1945 годов</small>
		</div>
	</div>
	<div id="methodCaesar" class="stats">
		<br>
		<h1>Cтатистика ВОВ</h1>
		<ul>
			<li>Людей погибло 46 млн.</li>
			<li>Воевало из Стерлитамака:16115</li>
			<li>Правители стран:</li>
				<li>CCCР:Ио́сиф Виссарио́нович Ста́лин</li>
				<li>Германия:Адо́льф Ги́тлер</li>
		</ul>
		<br>
	</div>
	<br>
	<div id="esar" class="year-war1941">
		<h1>Операции</h1>
		<a onclick="barb('barbarosa')">Операция Барбаросса</a><br>
		<a onclick="t('tif')">Операция Тайфун</a><br>
		<a onclick="y('yran')">Операция Уран</a><br>
		<a onclick="k('kolco')">Операция Кольцо</a><br>
		<a onclick="isk('iskra')">Операция Искра</a><br>
		<a onclick="cit('citad')">Операция Цитадель</a><br>
		<a onclick="kut('kutuzov')">Операция Кутузов</a><br>
		<a onclick="bag('bagrat')">Операция Багратион</a><br>
		<a onclick="vis('vislo')">Операция Висло-Одерская стратегическая наступательная операция</a><br>
		<a onclick="b('berl')">Берлинская стратегическая наступательная операция</a><br>
		<p id="barbarosa">
							Операция «Барбаро́сса» (Директива № 21. План «Барбаросса»; нем. 
							Weisung Nr. 21. Fall Barbarossa, в честь короля Германии и<br> императора Священной Римской империи Фридриха I Барбаросса) — разработанный в 1940—1941 годах план нападения нацистской Германии на СССР и одноимённая военная операция, осуществлявшаяся в соответствии с этим планом на начальной стадии Великой Отечественной войны.
							Решение Гитлера осуществить операцию «Барбаросса» против СССР стало поворотным в истории Третьего рейха, которое привело его к войне на два полномасштабных фронта, войне между ним и СССР и его краху четыре с половиной года спустя. При разработке плана «Барбаросса», рассчитанного только на «молниеносную войну», изначально была допущена недооценка противника и не учтена возможность перерастания быстротечной войны в затяжную[6]. В целом провал операции «Барбаросса» явился ключевым поворотным моментом Второй мировой войны[7]. 
		</p>
		<iframe width="543" height="407" src="https://www.youtube.com/embed/G4WlPX-Q7HQ" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
		<p id="tif">
							Би́тва за Москву́ (Моско́вская би́тва, Би́тва под Москво́й, 30 сентября 1941 года — 20 апреля 1942 года) — боевые действия советских и немецких войск на московском направлении. Делится на 2 периода: оборонительный (30 сентября — 4 декабря 1941 года) и наступательный, который состоит из двух этапов: контрнаступления (5 декабря 1941 года — 7 января 1942 года) и наступления советских войск (7 января — 30 марта 1942 года). В западной историографии битва известна как «Операция Тайфун».

							Сражение развернулось на пространстве, границы которого на севере проходили по реке Волге от Калязина до Ржева, на западе — по рокадной железнодорожной линии Ржев — Вязьма — Брянск, на юге — по условной линии Ряжск — Горбачёво — Дятьково.

							На оборонительном этапе сражения были проведены: Орловско-Брянская, Вяземская, Можайско-Малоярославецкая, Калининская, Тульская, Клинско-Солнечногорская и Наро-Фоминская фронтовые операции.

							5 декабря 1941 года Красная армия перешла в контрнаступление по всему фронту под Москвой, проведя при этом ряд успешных фронтовых наступательных операций и отбросила врага на 150—300 километров от столицы. 
		</p>
		<p id="yran">
							Сталинградская стратегическая наступательная операция, кодовое название Опера́ция «Ура́н» (19 ноября 1942 года[5] — 2 февраля 1943 года[6]) — контрнаступление во время Великой Отечественной войны войск трёх фронтов: Юго-Западного (командующий — генерал Н. Ф. Ватутин), Сталинградского (командующий — генерал А. И. Еременко) и Донского (командующий — генерал К. К. Рокоссовский) с целью окружения и уничтожения вражеской группировки войск в районе города Сталинграда. Координирование действий трёх фронтов осуществлял начальник Генерального штаба А. М. Василевский. 
		</p>
		<p id="kolco">
							Утром 10 января после мощного артиллерийского и авиационного удара советские войска атаковали оборонительные немецкие позиции. Танки и пехота противника предпринимали контратаки, поддержанные сильным огнём артиллерии.

							Немцы не смогли сдержать советские войска и стали отступать. Целые части и даже соединения сдавались в плен. 25 января 21-я армия ворвалась в Сталинград с запада. С востока атаковала 62-я армия. 26 января они соединились в районе Мамаева кургана. Немецкая 6-я армия была расчленена на северную и южную группировки.

 							Бои в городе продолжались несколько дней. 31 января южная группировка во главе с фельдмаршалом Ф. Паулюсом сдалась в плен. 2 февраля капитулировала и северная группировка. Операция «Кольцо» закончилась.

		</p>
		<p id="iskra">
							Опера́ция «И́скра» (нем. Zweite Ladoga-Schlacht — Вторая битва у Ладожского озера) — наступательная операция советских войск во время Великой Отечественной войны, проведённая с 12 по 30 января 1943 годаПерейти к разделу «#Операция «Искра» в историографии» силами Ленинградского и Волховского фронтов при содействии части сил Балтийского флота, Ладожской военной флотилии и авиации дальнего действия с целью прорыва блокады Ленинграда.

							18 января 1943 года блокаду Ленинграда прорвали. Согласно первоначальному плануПерейти к разделу «#План наступления под Ленинградом зимой 1942—1943 годов» советские войска продолжили наступление с целью разгрома мгинско-синявинской группировки противника и обеспечения надёжной железнодорожной связи Ленинграда со страной, но в ожесточённых боях в феврале—апреле развить достигнутый в январе успех не удалось. 
		</p>
		<p id="citad">
							Ку́рская би́тва (5 июля — 23 августа 1943 года; также известна как Битва на Курской дуге) — совокупность стратегических оборонительной (5—23 июля) и наступательных (12 июля — 23 августа) операций Красной армии в Великой Отечественной войне с целью сорвать крупное наступление сил вермахта и разгромить его стратегическую группировку[9]. По своим масштабам, задействованным силам и средствам, напряжённости, результатам и военно-политическим последствиям является одним из ключевых сражений Второй мировой войны и Великой Отечественной войны. В историографии считается самым крупным (величайшим) танковым сражением в истории[10][11][12][13][14]. В нём участвовали около 2 млн человек, 6 тысяч танков, 4 тысячи самолётов; сражение проложило «путь к великим советским наступательным действиям 1944-45 годов».

							Сражение является важнейшей частью стратегического плана летне-осенней кампании 1943 года, согласно советской и российской историографии, включает в себя: Курскую стратегическую оборонительную операцию (5—23 июля), Орловскую (12 июля — 18 августа) и Белгородско-Харьковскую (3—23 августа) стратегические наступательные операции. Битва продолжалась 50 дней. Немецкая сторона наступательную часть сражения называла операция «Цитадель».

							В результате наступления по плану «Кутузов» потерпела поражение орловская группировка немецких войск, а занимаемый ею орловский стратегический плацдарм был ликвидирован. По итогам операции «Полководец Румянцев» потерпела поражение белгородско-харьковская группировка немцев и соответствующий плацдарм также был ликвидирован[15]. Коренной перелом в ходе Великой Отечественной войны, начатый под Сталинградом, был завершён в Курской битве и сражении за Днепр, а в последовавшей Тегеранской конференции по инициативе Ф. Рузвельта уже обсуждался составленный им лично «2 месяца тому назад план расчленения Германии на пять государств».

							После завершения битвы стратегическая инициатива окончательно перешла на сторону Красной армии, которая продолжала освобождать страну от немецких захватчиков и до окончания войны проводила в основном наступательные операции. Вермахт в ходе отступления с территории СССР проводил политику «выжженной земли»[16].

							23 августа является Днём воинской славы России — День разгрома советскими войсками немецко-фашистских войск в Курской битве (1943 год). Белгород, Курск и Орёл стали первыми городами России, которым присвоено почётное звание «Город воинской славы»[17] 

		</p>
		<p id="kutuzov">
							Около 3 часов ночи 11 июля, в полосе Западного и Брянского фронтов после десятиминутного артиллерийского налета перешли в наступление выделенные для проведения силовой разведки усиленные батальоны. Их действия были поддержаны огнем части артиллерии с запасных позиций. В результате боев, длившихся весь день, эти батальоны на ряде участков преодолели полосу заграждений и овладели первой линией траншей, которая, как и предполагалось, была занята лишь небольшими силами немцев. Далее разведывательные батальоны подошли ко второй линии, где располагались основные силы противника, и здесь были остановлены контратаками и вновь отброшены к переднему краю. В результате этой разведки советское командование довольно точно установило истинный передний край обороны противника и его огневую систему. Это дало возможность уточнить задачи артиллерии, авиации и танкам. В частности, поправки, внесенные в ранее подготовленные данные для артиллерийского и авиационного наступления, позволили избежать ведения массированного огня по слабо занятой противником первой линии траншей, являвшейся своеобразным ложным передним краем. В докладе представителя Ставки маршала Жукова Верховному главнокомандующему о начале операции «Кутузов» было указано[68], что силовая разведка, проведенная накануне наступления, полностью подтвердила, что передовая траншея занималась только боевым охранением противника. Это дало возможность в последующем избежать напрасного расхода снарядов в период артподготовки.

							На участке 11-й гв. А ночью 11 июля авиация дальнего действия нанесла бомбовый удар по основным узлам сопротивления противника, с рассветом был произведен короткий, но мощный артиллерийский налет по переднему краю немецкой обороны, а самолеты-штурмовики поставили дымовую завесу. Под ее прикрытием в 3.30 часов 11 июля в атаку двинулись шесть специально выделенных передовых батальонов, по одному от каждой стрелковой дивизии первого эшелона[69]. Внезапная атака передовых батальонов привела к ряду частных успехов, на некоторых участках их бойцы заняли первую вражескую траншею, захватили пленных. Встревоженное командование немецкого 53-го ак начало проводить контратаки силами ближайших тактических резервов. По свидетельству маршала Баграмяна[70], из показаний пленных впоследствии стало ясно, что атака действительно была принята за начало наступления главных сил, поэтому немцы открыли мощный заградительный огонь, израсходовали в тот день более 10 тыс. снарядов и практически раскрыли свою огневую систему.
		</p>
		<p id="bagrat">
							Белорусская наступательная операция «Багратион» — крупномасштабная наступательная операция Великой Отечественной войны, проводившаяся 23 июня — 29 августа 1944 года. Названа так в честь полководца, получившего известность в ходе Отечественной войны 1812 года П. И. Багратиона. Одна из крупнейших военных операций за всю историю человечества. 

		</p>
		<p id="vislo">

							Висло-Одерская стратегическая наступательная операция — стратегическое наступление советских войск на правом фланге советско-германского фронта в 1945 году. Началась 12 января, завершилась 3 февраля. Проводилась силами 1-го Белорусского (командующий — маршал Советского Союза Георгий Жуков) и 1-го Украинского фронтов (маршал Советского Союза Иван Конев).

							В ходе Висло-Одерской операции от немецких войск была освобождена территория Польши к западу от Вислы и захвачен плацдарм на левом берегу Одера, использованный впоследствии при наступлении на Берлин. Операция носила стремительный характер — на протяжении 20 суток советские войска продвигались на расстояние от 20 до 30 км в день[1]. За это время они преодолели 7 укреплённых рубежей противника и 2 крупные водные преграды.

							Успеху операции, по мнению ряда западных историков, способствовала потеря двух элитных немецких танковых армий на Западном фронте в ходе Арденнской операции
		</p>
		<p id="berl">
							Берли́нская стратегическая наступательная операция — одна из последних стратегических операций советских войск на Европейском театре военных действий, в ходе которой Красная армия заняла Берлин, что привело к безоговорочной капитуляции Германии. Операция продолжалась 23 дня — с 16 апреля по 8 мая 1945 года, в течение которых советские войска продвинулись на запад на расстояние от 100 до 220 км. Ширина фронта боевых действий — 300 км. В рамках операции проведены: Штеттинско-Ростокская, Зееловско-Берлинская, Котбус-Потсдамская, Шпремберг-Торгауская и Бранденбургско-Ратеновская фронтовые наступательные операции, а также непосредственно штурм Берлина. 
		</p>
	</div>
	<br>
</body>
</html>